[
    {
        "text": "Gross!",
        "gt_label": 0,
        "polar_theta_deg": 1.5248906501629105,
        "polar_radius": 0.0503884244831907
    },
    {
        "text": "The worse service.",
        "gt_label": 0,
        "polar_theta_deg": 2.546954956501185,
        "polar_radius": 0.1021007063025109
    },
    {
        "text": "Great food, but awful service.",
        "gt_label": 2,
        "polar_theta_deg": 15.823220467348548,
        "polar_radius": 0.064979348961822
    },
    {
        "text": "food isn't good",
        "gt_label": 1,
        "polar_theta_deg": 23.36064903395412,
        "polar_radius": 0.2997414461696728
    },
    {
        "text": "Came here today. Got seated by the host and never got service! After about 20 mins of servers walking by and others being served that came in after we did we decided to leave.. Maybe we smelled bad???  but still gonna give it 1 star for being seated",
        "gt_label": 0,
        "polar_theta_deg": 29.467074786110004,
        "polar_radius": 0.4282352907205156
    },
    {
        "text": "Went the first time and it was gross!! The server had a attitude. The only reason for 2 stars was for the nice lady who dropped off the chips and salsa. Salsa was bland and tasted bad/old. The ground beef and shredded beef tacos were a light brown color... Never seen meat look that color. Taste was even worse than it looked bad and texture was huge chunks.. Beans and rice tasted like they were cooked in old fat and sitting for days. Do not waste any money in going here!!!",
        "gt_label": 1,
        "polar_theta_deg": 29.43179141476917,
        "polar_radius": 0.6848820859090754
    },
    {
        "text": "I went to the bar last night (sat) and it took FOREVER to get my drink. I order a Long Island, when I got it the drink was CLEAR! I told the bartender \\\"Ashely\\\" that my drink wasn't right and she had the nerve to take a drink out of my drink and told me \\\"it taste fine and I not making you a new one\\\"! WTF don't ever go here!",
        "gt_label": 0,
        "polar_theta_deg": 29.27950339057705,
        "polar_radius": 0.7428112452111805
    },
    {
        "text": "Horrible crooks !!! These people are con artists and are now impersonating another moving company with good reviews to get clients ! Please file a complaint online with the attorney general if they have scammed you and damaged your items.",
        "gt_label": 0,
        "polar_theta_deg": 26.64263324308848,
        "polar_radius": 1.0033952113602675
    },
    {
        "text": "Tasty",
        "gt_label": 2,
        "polar_theta_deg": 36.43571663230413,
        "polar_radius": 0.0009864787751775
    },
    {
        "text": "I worked there. Believe me, you do not want to eat there. \\nHygiene? methinks not.",
        "gt_label": 0,
        "polar_theta_deg": 34.974021739348515,
        "polar_radius": 0.2865108182217742
    },
    {
        "text": "Closed in under a year.... oh well Cream was better...",
        "gt_label": 0,
        "polar_theta_deg": 38.46466196807356,
        "polar_radius": 0.4059333211541063
    },
    {
        "text": "Missing lots of stores, is old looking, disheveled, and dirty. Very crowded despite being horribly cramped and messy. Everything about this mall screams \\\"don't go here.\\\" I'd give no stars if I could.",
        "gt_label": 0,
        "polar_theta_deg": 35.138755070377606,
        "polar_radius": 0.5559566096439931
    },
    {
        "text": "I've been here a couple of times and the only thing that pops into my head is MEH. The BBQ Sauce is meh and leaves a nasty lingering after taste. The Rib Tip platter is ok, nothing to get too excited about this place. Meh, I've experienced better.",
        "gt_label": 1,
        "polar_theta_deg": 36.29997133089742,
        "polar_radius": 0.8344888160214271
    },
    {
        "text": "We enjoyed living here for 3 years; however, when we bought a house we put in our 60 day notice. We kept the apartment immaculate and were never late on payments. They wanted to do the walk through without us; however, I insisted that my father-in-law be present since it was after our move out date and I didn't trust them to give an accurate move out quote. I wanted to be proactive and called a couple days after the walk through to find out if we would be getting our deposit back or if there were any charges. They told me they couldn't help me and told me someone else dealt with move outs and would call me as soon as they returned to the office. Of course, they never called. I called again and got the same response. Assuming this was the second time I went out of my way to find out about the deposit, I assumed they would have this person call me back. Nope! I called a THIRD time, still no one could help me except this ONE person who clearly doesn't do her job. I finally had my father-in-law go to the office because at this point it was a month after our move out date. He spoke with the manager Kelly, who gave him a long story about how they take photos and it goes to the corporate office and someone would get back to us soon. Being proactive proved to not work with this company. Tonight, we received a letter titled \\\"Urgent attention requested by Christine Hambric, the assistant manger who was supposed to return four of my requests.\\\" It states that the \\\"balance due for the apartment has been held from collections for WELL OVER 30 days. If no contact is made, the balance will be referred to collections.\\\" My husband and I are furious. Not only did we contact them 4 times in the last month and a half, but they have never returns my calls and this is the first time we have heard from them. There is not even an explanation of the fees. The letter just states that it will go to collections if it is not paid in a week. The office will be hearing from me bright and early tomorrow. If they don't resolve this, I will contact those at the corporate office. This is no way to treat people that were always on time with payments, clean, and respectful residents. I am not a person that writes poor reviews and find that we are very easy going people. However, I cannot believe that a company could treat good residents like this. Do yourself a favor and don't live here. I'm extremely disappointed.",
        "gt_label": 0,
        "polar_theta_deg": 36.471257737418064,
        "polar_radius": 1.0966496071901837
    },
    {
        "text": "Not very good",
        "gt_label": 0,
        "polar_theta_deg": 40.45083395885348,
        "polar_radius": 0.0368179200892573
    },
    {
        "text": "5 dollar foot long",
        "gt_label": 3,
        "polar_theta_deg": 42.33435740299073,
        "polar_radius": 0.1062372712039727
    },
    {
        "text": "Was disappointed with this place. Thought pad thai was pretty standard but it lacked flavor here. It was pretty spicy but not that enjoyable. However the spring rolls were pretty good and I enjoyed the Thai iced tea. \\n\\nThe service was alright and the environment was nice and friendly but I don't think I will make it my staple thai place.",
        "gt_label": 1,
        "polar_theta_deg": 43.76753121256953,
        "polar_radius": 0.3963862817132147
    },
    {
        "text": "It's not a bad hotel for the price.  Really.\\n\\nThe room I stayed in was fine (save for some odd stains on the curtains), the casino and show offerings are about standard (Carrot Top, Criss Angel), and there's a fairly diverse selection of restaurants.\\n\\nThat said, if you want to drop an extra $40 or $50 a night and stay somewhere else, I'd probably recommend doing that.  While I'd take the Luxor over the Imperial Palace, it's certainly no Caesar's or Mandalay Bay.",
        "gt_label": 2,
        "polar_theta_deg": 41.122659489184265,
        "polar_radius": 0.5844931565533998
    },
    {
        "text": "I did not like this location AT ALL.   I was overwhelmed on where to park... I couldn't figure out if you park in front or back.  Then I couldn't figure out where the front door was or where you get seated at.  I walked in a complete circle around the place 1 1/2 times.  Then it is dark and crowded.  The service was very hurried and it was not conducive to sitting and enjoying a meal together as there were people waiting for our table (if you are even lucky enough to get a private table).  I much much much prefer the Dobson/Guadalupe location and won't return to this one.\\n\\nHowever, the food is delicious.  The potato leek soup.  Yummmmm... the bread it is served with is Yummmmm... the pasty was Yummmm (I had the vegetarian potato one with ketchup).  Wish I had saved room for the peanut butter and jelly dessert one as I like it so much.",
        "gt_label": 2,
        "polar_theta_deg": 44.96065812274672,
        "polar_radius": 0.7896188890060835
    },
    {
        "text": "Honestly, don't waste your money and go to Laser Quest. If you have the unfortunate timing to have issues with the workings of the business while Vinny is in charge, nothing will get solved. Vinny is one of the owner's relatives and treats you exactly like one would expect - terribly because he can get away with it. He will smirk at you like a sleezy used car salesman, if it wasn't already obvious that since he already has your money, there's nothing he's willing to do for you. \\n\\nThey allow too many people into each game (up to 60) so if you have problems with your pack, which has likely a 25% chance of failure, you are forced into a cycle of being shot and not able to play since everyone else got a 30 second start. \\n\\nAlso, if they're having a special that you call to confirm, be advised that the employees may not give you all of the information needed to get the special, such as the need to physically print coupons, and, of course, Vinny will do nothing to remedy the situation. \\n\\nTL; DR: Save your time, money, and frustration and go to Laser Quest, where you also get to make up silly player names.",
        "gt_label": 0,
        "polar_theta_deg": 41.81230338334916,
        "polar_radius": 1.0710633693918876
    },
    {
        "text": "Food very good ,place very clean",
        "gt_label": 4,
        "polar_theta_deg": 47.06295363042641,
        "polar_radius": 0.0833209172467771
    },
    {
        "text": "Too bad they're closed on sunday. Definitely better than mcdonalds. I love this place!",
        "gt_label": 3,
        "polar_theta_deg": 45.66238735928027,
        "polar_radius": 0.2771689936161431
    },
    {
        "text": "Visited during the BCS championship game.\\n\\nThe service we had was excellent, even during the game.  Our server, Jimmy, was very friendly and attentive, even during this madhouse. BTW, we did visit Midland, TX on our way back for some BBQ, nice town.\\n\\nWe had some wings and they were very big and spicy.  The chicken fingers for the kids were average.  The beer selection was average, I wish these bars would include local microbrew selections!",
        "gt_label": 2,
        "polar_theta_deg": 48.44758721279565,
        "polar_radius": 0.4814539610758884
    },
    {
        "text": "The bacon and eggs were great and the coffee was also.. The sandwiches not my favorite. But breakfast is a YES",
        "gt_label": 2,
        "polar_theta_deg": 47.42968114028462,
        "polar_radius": 0.5365889436449476
    },
    {
        "text": "Restaurant Week Meal #7 (Lunch for $30.13):\\nAppetizer: Cantaloupe Soup OR Portabello Piccata OR Caprese Tart\\n\\nEntree: Roasted Breast of Chicken OR Lake Superior Whitefish OR Grilled Skirt Steak\\n\\nDessert: Coconut Caramel Cake OR Seasonal Sorbet Trio\\n\\nSince I was already getting the steak, my friend opted to get a burger and truffle fries instead of doing RW. I was asked if I've tried Olives before and I haven't...we had bread service and that's when I realized why I haven't been here - I'm allergic to olives! Too late, we already placed our order.\\n\\nCantaloupe Soup:\\nWith almonds and minted creme fraiche. I like cantaloupe so this was an easy choice plus, it's different. A nice, cool and refreshing soup. It's lightly salted so it's not like eating dessert. It's best eaten with a spoon which the server didn't give me. 4/5\\n\\nGrilled Skirt Steak:\\nCame with Italian sausage mashed potatoes, roasted Brussels sprouts, Pinot Noir reduction topped with watercress salad. I love steak but this one was not that good especially if they don't give you a steak knife. 3.5/5\\n\\nCoconut Caramel Cake:\\nCame with chocolate malt ice cream and coconut brittle. I'm not a fan of coconut but I was not in the mood for sorbet either.  The ice cream was very good. The cake was like a deconstructed macaroon. Not too bad. 4/5\\n\\nOlive's Burger and Truffle Fries:\\nDressings on the side: pickles, tomatoes and onions. This usually comes with Parmesan Fries but my friend got it substituted with Truffle Fries. His first burger was cooked medium-well...and dry so he sent it back.  The second burger was perfectly medium-rare. Tasty and juicy. The fries were perfect! 4.5/5\\n\\nDespite the utensil snafu, Olives has good things going on.  The burger and truffle fries...yum! They have a nice view of the Miracle Mile and the Fountains of Bellagio if you sit at the patio. There are birds waiting for a free meal but they're not pesky.",
        "gt_label": 3,
        "polar_theta_deg": 49.26674131164871,
        "polar_radius": 0.9019579726177424
    },
    {
        "text": "I went on this hike with the hike and brew UYE group...which was awesome! This is not close to my house and therefore would never be a regular hike for me. Despite this, the facilities are very nice, there are nice places to take a  break along the trail. So why not 5 stars? It was really easy.... all of the switchbacks make for a pretty flat hike and when you get to the 'highest point' there is no view....what's up with that? The actual peak isn't accessible via the trail and obscures your view of the city....not awesome. I was pretty disappointed. The backside of the hike is a little more of a challenge than the front but still nothing too difficult. I guess it is a testament to my personality, but I like a hike that goes straight up to the top of the mountain so I can get a good view and a good workout and be done with it.... maybe I have no patience, but if you are like me, this may not be the hike for you. Otherwise, this is a pretty nature hike that is fairly easy, so go for it!",
        "gt_label": 3,
        "polar_theta_deg": 47.69127314533058,
        "polar_radius": 1.2204114193535425
    },
    {
        "text": "great service and great quality food.  \\n\\nthe continental breakfast was delicious and plentiful",
        "gt_label": 4,
        "polar_theta_deg": 51.84400788844611,
        "polar_radius": 0.0887096810956052
    },
    {
        "text": "Very good sushi, prices are a bit high but I'm not complaining.  I'll be back :)",
        "gt_label": 3,
        "polar_theta_deg": 58.91778059843919,
        "polar_radius": 0.2767277791022409
    },
    {
        "text": "Very good food! I had the al pastor tacos, my mom had the carne asada ones. Both had great flavor! The guacamole was okay- basic, nothing super special, but it was very fresh. The house rice and the white sangria were both fantastic. I would definitely recommend going here.",
        "gt_label": 3,
        "polar_theta_deg": 53.32250998202817,
        "polar_radius": 0.4398464448432495
    },
    {
        "text": "Typical sports bar with the usual bar food. We really like the chicken strips and fries basket. Portions are a little smaller than the averagle sports bar (3 thin strips in an order) but there is a big serving of fries with it. The pizza was surprisingly good here. \\n\\nService was a little slow on our last visit but I have a good amount of patience that it didn't bother me too much. Price is pretty on par, maybe a tad bit more, than other sports bar.",
        "gt_label": 2,
        "polar_theta_deg": 52.21902038762083,
        "polar_radius": 0.632062167350683
    },
    {
        "text": "I'm so happy I could cry. Tijuana flats is my favorite quick eats restaurant and there's now one down the street from me! Delicious! You can't go wrong with anything on the menu. The sweet chili sauce is mixed w the peach sauce is the best. I really hope this place takes off since I've seen businesses come and go at this end of east blvd.",
        "gt_label": 4,
        "polar_theta_deg": 51.3820662984867,
        "polar_radius": 0.8748139302993917
    },
    {
        "text": "Let's just say - Pen & Teller were magical! (ba dum tsss!)\\n\\nWe luckily scored comped tickets with awesome seats for my boyfriend's birthday. We enjoyed the show so much, we would definitely buy tickets and watch them again in the future. Can you believe they've been performing at the Rio for 13 years! That's incredible and commendable. They are true Vegas entertainers. I love that they change up their acts and throw in new ones. We were very entertained, wow'ed and in awe like school kids - we thoroughly enjoyed the show!\\n\\nPenn also grooves out on the upright bass with Mike Jones before the show, so make sure to catch that - he's totally in his element and it's heartwarming.\\n\\nPenn & Teller are an amazing duo, they are really meant to be on stage together. They are both so lovable, funny, friendly, and super nice! I'm glad that they take the time to take pictures with each and every one of their guests after the show.\\n\\nNot to give out any detailed spoilers, these were my favorite tricks:\\n- Penn & Teller's cell phone act\\n- Teller & ball act\\n- Teller & gold dollar coins \\n- Penn & Teller's cow act\\n\\nI would say I had only 2 complaints:\\n- Photos are prohibited during the show (whoops!)\\n- It's freezing in the theatre, so definitely dress accordingly",
        "gt_label": 4,
        "polar_theta_deg": 50.19982330954767,
        "polar_radius": 1.0114874921745536
    },
    {
        "text": "Great tacos!!!",
        "gt_label": 3,
        "polar_theta_deg": 81.70664009079044,
        "polar_radius": 0.0229579598721701
    },
    {
        "text": "There isn't much to say that hasn't been said.  Easily the best meal I've ever had.",
        "gt_label": 4,
        "polar_theta_deg": 60.948466717467,
        "polar_radius": 0.2653383208827787
    },
    {
        "text": "We've popped by for happy hour a few times. Great prices. Love the wings! Great atmosphere, especially when it's patio weather.",
        "gt_label": 3,
        "polar_theta_deg": 61.23879141972245,
        "polar_radius": 0.4935230552693769
    },
    {
        "text": "Always will get my tires at Discount. Service and prices pretty much are hard to beat. The staff is always helpful, friendly and knows tires. HIGHLY recommend them!",
        "gt_label": 4,
        "polar_theta_deg": 62.66345266246863,
        "polar_radius": 0.6406353309378717
    },
    {
        "text": "Fresh, hot, made to order burgers and fries, and shakes that are to die for... What else could you ask for in a burger joint?! I love being able to build my dream sammich every time and indulge in differently flavored fries and extravagant shakes. Love it!",
        "gt_label": 2,
        "polar_theta_deg": 63.54910408019135,
        "polar_radius": 0.8732188272742636
    },
    {
        "text": "Great haircuts (w/ neck shave), Miller High Life on tap, and cheap. What more could you want?",
        "gt_label": 4,
        "polar_theta_deg": 64.39593882938361,
        "polar_radius": 1.0109246875226232
    },
    {
        "text": "Ask for Rory. The ex-Oregon State Beaver",
        "gt_label": 4,
        "polar_theta_deg": 60.299251367821626,
        "polar_radius": 3.33653880074047
    },
    {
        "text": "Most excellent",
        "gt_label": 4,
        "polar_theta_deg": 85.97816072628049,
        "polar_radius": 0.0144303588246916
    }
]