[
    {
        "text": "This place is really gross. The boba tastes too chalky and it's definitely not wort more than $5. Over priced. Save yourself the woe and just drive to Chinatown.",
        "gt_label": 0,
        "polar_theta_deg": 27.77132467960338,
        "polar_radius": 0.627911679091656,
        "row_id": 47211
    },
    {
        "text": "This Mimi's is the worst. The vibe is as if they are a restaurant in training. My server was nice but slightly flustered.\\n\\nI ordered the benedict with bacon and tomatoes. When you look at the picture on how it was served it was sloppy and made with no care. Mimi's has always given some presentation but this was food on a plate.\\n\\nIt looked a mess and then I put my fork in it had egg shells inside. I said to my family I knew this dish looked off when it arrived and now egg shells.\\n\\nI told my server and she was great about getting me something else and apologizing. So I ordered my next usual the Quiche Lorraine taste great but once again thrown on a plate. Typically its served on lettuce with fruit on a plate. This was not the case.\\n\\nLow Fat Blueberry muffin was great as always..\\n\\nThis location just didn't feel welcoming and the experience was subpar, management they need help.",
        "gt_label": 0,
        "polar_theta_deg": 40.54309875414747,
        "polar_radius": 0.8848015966121558,
        "row_id": 4120
    },
    {
        "text": "Food was great and reasonably priced with restaurant.com coupon. I would've gave five stars if the waiter wasn't so cocky and direct.",
        "gt_label": 2,
        "polar_theta_deg": 43.02744459352085,
        "polar_radius": 0.5498103381839575,
        "row_id": 16920
    },
    {
        "text": "Basically, the same premise as Cold Stone. You chose an ice cream flavor and they work in whatever mix-ins you like...on a cold marble slab.\\n\\nThey are fairly small, so their selection of flavors and toppings was a little smaller than other paces I have been, but there wasn't anything in particular I was looking for that I was missing so.\\n\\nThe ice cream as good. I got carrot cake ice cream with walnuts & caramel.  It was pretty delicious.\\n\\nThe reason for less stars is the service. We had a BOGO coupon & they didn't want to honor it because it didn't have my name printed on it. WTF? First of all, you guys emailed it to me so if you want my name on it, put it on there. Second, WHY do you need my flippin' name?!? I can't say they said or did anything wrong, but you know how someone is just giving attitude....they were. In the end they honored my coupon, but they made me feel like they were hardcore doing me a favor.\\n\\nI don't live on this side of town, so I probably won't go back unless I'm in that area.",
        "gt_label": 2,
        "polar_theta_deg": 44.2790949883877,
        "polar_radius": 0.8618966824157244,
        "row_id": 29897
    },
    {
        "text": "I wanted to love Scarpetta, I really did. I was still mesmerized by the striking view I got to take in during the grand opening and determined to prove all of the reviews about the mediocre service wrong, but our waiter left me no choice but to report otherwise.\\n\\nI want to point out the highlights before I rip Scarpetta to shreds. I came in for Restaurant Week so got the pre-fixe menu and chose the yellowtail, short rib agnolotti, and coconut panna cotta. I thought the yellowtail had great flavor and was presented beautifully. My only complaint was that it seemed to be served a little on the warm side to me which is a concern when it comes to raw fish.\\n\\nThe coconut panna cotta/guava soup was not only delicious but beautiful too. The almost tart soup was a nice contrast to the creamy panna cotta-probably the best panna cotta I've ever had! Not too rich or too sweet, and again, perfectly balanced with the cold fruit soup. I usually don't go for dessert soups, but I'd probably come back just for that.\\n\\nThe view is killer-great front row seats to the Bellagio water show!\\n\\nNow for the bad.\\n\\nStrike one: Maybe this is just me being very nitpicky, but the presentation of the short rib agnolotti was just gross. The pasta was served in a wide, shallow bowl and the appearance of pasta in one thin layer with hardly any garnish (save the breadcrumbs which had a nice flavor) was just unappetizing. Also, the pasta was incredibly greasy. I've had pasta in brown butter sauce before that didn't look like that. The filling was good, very rich and flavorful, but the sauce was just off-putting. \\n\\nStrike two: for the duration of our dinner, a toddler continuously screamed at the top of his lungs, banged on the table, stood on the booth in which his family was sitting and annoyed the crap out of the surrounding diners. As a fine dining restaurant, it's your responsibility to make sure that the experience is just that, fine dining. Which means if you need to tell this family who cannot control their spoiled infant to beat it, in the interest of preserving the experience for surrounding diners, then do it. After an hour of embarrassing behavior and ugly stares from other tables, the dad who was elegantly dressed in board shorts, shower shoes and a baseball cap removed the child from the fine dining situation. I feel like the management should've handled this earlier, but God forbid they offend one person who is offending the entire restaurant. \\n\\nStrike three: our waiter was a dud. I get it, everyone has their off days, but I think this waiter's life was a series of off days. I'm hoping that his service standards weren't lowered because we were getting what was essentially a discounted menu, but I can't help that think this was the case. Discounted menu=less tip? Not always. But if your behavior warrants a tip to match the discounted bill then that's what you'll get. It took about 15 minutes for bread to come out and for the waiter to bring water. Then another 15 minutes for him to take our order for wine. And about another 20 minutes to take our food order. I shouldn't have to flag you down and tell you we're ready to order. That's not my job as a patron of the restaurant. I wasn't in any rush, but those lapses in time mean either this dude was just straight up inattentive or suffering the early stages of dementia. Everything about the dinner just dragged on unnecessarily. He was inattentive and seemed disinterested in our table-there were only two of us and we're definitely not high maintenance so I'm not sure what the issue was.\\n\\nOur waiter was in no way personable and just rubbed me the wrong way. Maybe we caught him on a bad night. Maybe he didn't feel like we deserved the attention that someone who was ordering off of the regular menu did. Regardless, in these economically unbalanced times, when so many people are opting to eat cheaper or stay home and cook, I feel like the restaurant industry should feel the pressure to give diners the experience they pay for. Even if we were getting your dishes for a reduced price-we are still dining in your restaurant and your standard of service should be equal across the board. You are a fine dining restaurant and I hold you to a higher standard than, say a Denny's. But if you perform like a Denny's waiter, I will tip you like a Denny's waiter. \\n\\n\\nI'm not sure I would come back because I was truly annoyed with the service. Maybe I'd come back for the guava soup...and have it at the bar.",
        "gt_label": 1,
        "polar_theta_deg": 43.28134731672686,
        "polar_radius": 1.071708985651454,
        "row_id": 30177
    },
    {
        "text": "I've been waiting for this place to open and was so excited when it finally did. I just got my first chance to go yesterday. It wasn't as good as I was hoping for. Our waitress seemed like she wanted to be anywhere but there and was impossible to find most of the time. Two people at our group ordered coffee and she never came around to give them a refill. The food was ok but I honestly could have made the same stuff at my house and I'm not even a great cook. I'm not totally writting them off...I know they just opened so I'm hoping that they will work out the kinks. I'll probably try them again in a couple months...I won't be rushing back next weekend!",
        "gt_label": 1,
        "polar_theta_deg": 39.06902845562704,
        "polar_radius": 1.0880799745622862,
        "row_id": 43469
    },
    {
        "text": "Here is another casino that we play at when we're in town.  Casino part is ok.  It's a little bit cheaper sometimes than the strip but not always the stations casions (this is if you're playing tables).  They don't have that many 1 cent slots as the stations casinos.  Food here is good.  I like the shops that they have outside.  Even the movie theater is nice, which is a change of pace if you want to take a break from eating/gambling.",
        "gt_label": 3,
        "polar_theta_deg": 48.374262051015634,
        "polar_radius": 0.9216457979255984,
        "row_id": 14134
    },
    {
        "text": "Some of the best hot subs in Vegas.  No matter what you decide on it's always the way you want it.  The only difference in visiting one location than another is the seating area.   Service is always fast and staff comes off as genuinely kind and welcoming.  It's no surprise they make best of Vegas every year.  Always a weekly stop for lunch and will always be a suggested to somebody that crazily enough may not have eaten here before.",
        "gt_label": 3,
        "polar_theta_deg": 53.90240347829319,
        "polar_radius": 0.796917818713139,
        "row_id": 11141
    },
    {
        "text": "What a beautiful, unique, delicious new restaurant. Sampled a little bit of everything!!  Mushroom tacos, dried fruit guac, yellowtail ceviche, summer corn, and chicken mole...all of which were phenomenal. The plating is especially beautiful, with each dish looking like a work of art. Also pleasantly surprising were the prices, which at this level of quality, combined with the location, I would have expected to be far higher. \\nService was equally excellent, as is the ambience. I hope this place is very successful!!",
        "gt_label": 4,
        "polar_theta_deg": 52.68622830359099,
        "polar_radius": 0.7309364451332179,
        "row_id": 49496
    },
    {
        "text": "One word...AMAZING!!!! Lavey and Janine are two of the most professional, down to earth and sweetest women I have ever met in my life. I was so nervous the morning of my wedding and they put me completely at ease. They did hair and makeup for myself, matron of honor and bridesmaid. We all felt like absolute rockstars when we were done. I myself felt more beautiful than I have ever felt in my entire life. Our wedding guests are still talking about how beautiful I looked and the pictures are incredible. They went above and beyond my expectations!!! Thank you girls for being a part of my dream come true! I highly recommend Your Beauty Call for weddings, parties or even just a night out on the town. I will definitely be using them every time I come back to Vegas. I love these girls!!!",
        "gt_label": 4,
        "polar_theta_deg": 55.97681686305664,
        "polar_radius": 1.1477972462596742,
        "row_id": 41036
    }
]